Revit 2027 API
StripedRowPattern Enumeration
 An enumerated type representing the possible sets of rows of a striped row schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StripedRowPattern
Public Enumeration StripedRowPattern
public enum class StripedRowPattern
type StripedRowPattern
Members
Member name | Value | Description
FirstRow | 0 |  The first row and every other row thereafter.
SecondRow | 1 |  The second row and every other row thereafter.
See Also
Reference
Autodesk.Revit.DB Namespace